In [1]:
import pandas as pd

In [2]:
index = [0,1,2]
columns = ['c1','c2','c3','c4']

data = [
    [1,1,1,1],
    [2,2,2,2],
    [3,3,3,3]
]
df1 = pd.DataFrame(data, index=index, columns=columns)

In [7]:
df1

   c1  c2  c3  c4
0   1   1   1   1
1   2   2   2   2
2   3   3   3   3

In [3]:
index = [0,1,2]
columns = ['d1','d2','d3','d4']

data = [
    [1,1,1,1],
    [2,2,2,2],
    [3,3,3,3]
]
df2 = pd.DataFrame(data, index=index, columns=columns)

In [8]:
df2

   d1  d2  d3  d4
0   1   1   1   1
1   2   2   2   2
2   3   3   3   3

In [10]:
pd.concat([df1,df2], axis=1)

   c1  c2  c3  c4  d1  d2  d3  d4
0   1   1   1   1   1   1   1   1
1   2   2   2   2   2   2   2   2
2   3   3   3   3   3   3   3   3